In [1]:
import numpy as np
import pandas as pd

### Win Shares Data.  
Pretty much already as we need it.

In [9]:
WS_df = pd.read_csv("db/WinShares.csv")
WS_df.head(10)

    playerID  CareerWS
0   ruthba01       756
1   cobbty01       722
2  bondsba01       699
3  wagneho01       655
4  aaronha01       643
5   mayswi01       642
6  youngcy01       634
7  speaktr01       630
8  musiast01       604
9  collied01       574

### Pitching Data  
This will be the source of our statistics.

In [10]:
pitching_df = pd.read_csv("db/Pitching.csv")

Since we aren't concerned about per-team statistics, let's combine all multiple-stint years into one row.

In [11]:
batting_df = batting_df.groupby(["playerID","yearID"],as_index=False).sum()
batting_df.head(10)

,playerID,yearID,stint,G,AB,R,H,2B,3B,HR,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,aardsda01,2004,1,11,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0
1,aardsda01,2006,1,45,2,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0,0.0,1.0,0.0,0.0
2,aardsda01,2007,1,25,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,aardsda01,2008,1,47,1,0,0,0,0,0,0.0,0.0,0.0,0,1.0,0.0,0.0,0.0,0.0,0.0
4,aardsda01,2009,1,73,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0
5,aardsda01,2010,1,53,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0
6,aardsda01,2012,1,1,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0
7,aardsda01,2013,1,43,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0
8,aardsda01,2015,1,33,1,0,0,0,0,0,0.0,0.0,0.0,0,1.0,0.0,0.0,0.0,0.0,0.0
9,aaronha01,1954,1,122,468,58,131,27,6,13,69.0,2.0,2.0,28,39.0,0.0,3.0,6.0,4.0,13.0

But first, one more thing.  We'll use At Bats to determine players' most dominent decade.

In [12]:
decades_df = batting_df[["playerID", "yearID", "AB"]]
decades_df

        playerID  yearID   AB
0      aardsda01    2004    0
1      aardsda01    2006    2
2      aardsda01    2007    0
3      aardsda01    2008    1
4      aardsda01    2009    0
5      aardsda01    2010    0
6      aardsda01    2012    0
7      aardsda01    2013    0
8      aardsda01    2015    1
9      aaronha01    1954  468
10     aaronha01    1955  602
11     aaronha01    1956  609
12     aaronha01    1957  615
13     aaronha01    1958  601
14     aaronha01    1959  629
15     aaronha01    1960  590
16     aaronha01    1961  603
17     aaronha01    1962  592
18     aaronha01    1963  631
19     aaronha01    1964  570
20     aaronha01    1965  570
21     aaronha01    1966  603
22     aaronha01    1967  600
23     aaronha01    1968  606
24     aaronha01    1969  547
25     aaronha01    1970  516
26     aaronha01    1971  495
27     aaronha01    1972  449
28     aaronha01    1973  392
29     aaronha01    1974  340
...          ...     ...  ...
97962  zupcibo01    1992  392
97963  zupcibo01    1993  286
97964  zupcibo01    1994   92
97965   zupofr01    1957   12
97966   zupofr01    1958    2
97967   zupofr01    1961    4
97968  zuvelpa01    1982    1
97969  zuvelpa01    1983    5
97970  zuvelpa01    1984   25
97971  zuvelpa01    1985  190
97972  zuvelpa01    1986   48
97973  zuvelpa01    1987   34
97974  zuvelpa01    1988  130
97975  zuvelpa01    1989   58
97976  zuvelpa01    1991    0
97977  zuverge01    1951    0
97978  zuverge01    1952    0
97979  zuverge01    1954   66
97980  zuverge01    1955   27
97981  zuverge01    1956   17
97982  zuverge01    1957   23
97983  zuverge01    1958    9
97984  zuverge01    1959    0
97985  zwilldu01    1910   87
97986  zwilldu01    1914  592
97987  zwilldu01    1915  548
97988  zwilldu01    1916   53
97989   zychto01    2015    0
97990   zychto01    2016    0
97991   zychto01    2017    0

[97992 rows x 3 columns]

In [13]:
x = decades_df.loc[:, "yearID"] / 10
decades_df.loc[:, "decade"] = 10 * x.round()
decades_df.head()

C:\Users\Laptop 1\Anaconda3\lib\site-packages\pandas\core\indexing.py:362: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[key] = _infer_fill_value(value)
C:\Users\Laptop 1\Anaconda3\lib\site-packages\pandas\core\indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

    playerID  yearID  AB  decade
0  aardsda01    2004   0  2000.0
1  aardsda01    2006   2  2010.0
2  aardsda01    2007   0  2010.0
3  aardsda01    2008   1  2010.0
4  aardsda01    2009   0  2010.0

In [14]:
decades_df = decades_df.groupby(["playerID", "decade"], as_index=False).sum()
decades_df.head()

    playerID  decade  yearID    AB
0  aardsda01  2000.0    2004     0
1  aardsda01  2010.0   14065     3
2  aardsda01  2020.0    2015     1
3  aaronha01  1950.0    1954   468
4  aaronha01  1960.0   21560  6612

In [15]:
decades_df = decades_df.sort_values(["playerID","AB"], ascending=[True, False]).reset_index()
decades_df.head()

   index   playerID  decade  yearID    AB
0      1  aardsda01  2010.0   14065     3
1      2  aardsda01  2020.0    2015     1
2      0  aardsda01  2000.0    2004     0
3      4  aaronha01  1960.0   21560  6612
4      5  aaronha01  1970.0   17730  4548

Keep the first occurance of each player.  Having sorted the data in descending order of at bats, that would be the player's dominant decade.

In [16]:
decades = []
names = []
prevname = ''
for index, player in decades_df.iterrows():
    if player["playerID"] != prevname:
        names.append(player["playerID"])
        decades.append(player["decade"])
        prevname=player["playerID"]
      
decades2_dict = {"playerID": names,
                  "decade": decades}
decades2_df = pd.DataFrame(decades2_dict)

In [17]:
decades2_df.head(10)

    playerID  decade
0  aardsda01  2010.0
1  aaronha01  1960.0
2  aaronto01  1960.0
3   aasedo01  1990.0
4   abadan01  2000.0
5   abadfe01  2010.0
6  abadijo01  1880.0
7  abbated01  1900.0
8  abbeybe01  1890.0
9  abbeych01  1900.0

Oh, and one more thing.  We need to know the last year a player was active, so that we know if they are even eligible for the Hall of Fame.

In [18]:
years_df = batting_df[["playerID", "yearID"]]
# drop duplicates that exist because a player might play for more than one team in any given year
years_df = years_df.drop_duplicates()
lastyear_df = years_df.groupby(["playerID"], as_index=False).max(axis="yearID")
lastyear_df = lastyear_df.rename(columns={"yearID":"lastyear"})
lastyear_df.head(20)

     playerID  lastyear
0   aardsda01      2015
1   aaronha01      1976
2   aaronto01      1971
3    aasedo01      1990
4    abadan01      2006
5    abadfe01      2017
6   abadijo01      1875
7   abbated01      1910
8   abbeybe01      1896
9   abbeych01      1897
10  abbotda01      1890
11  abbotfr01      1905
12  abbotgl01      1984
13  abbotje01      2001
14  abbotji01      1999
15  abbotku01      2001
16  abbotky01      1996
17  abbotod01      1910
18  abbotpa01      2004
19   aberal01      1957

In [19]:
# also need number of seasons
numyear_df = years_df.groupby(["playerID"], as_index=False).count()
numyear_df = numyear_df.rename(columns={"yearID":"numyears"})
numyear_df.head(15)

     playerID  numyears
0   aardsda01         9
1   aaronha01        23
2   aaronto01         7
3    aasedo01        13
4    abadan01         3
5    abadfe01         8
6   abadijo01         1
7   abbated01         9
8   abbeybe01         5
9   abbeych01         5
10  abbotda01         1
11  abbotfr01         3
12  abbotgl01        11
13  abbotje01         5
14  abbotji01        10

In [20]:
posYrG_df.columns

Index(['playerID', 'yearID', 'Games_P', 'Games_C', 'Games_1B', 'Games_2B',
       'Games_3B', 'Games_SS', 'Games_OF'],
      dtype='object')

### Now, it's time to put it all together

In [21]:
batting_df = pd.merge(batting_df, positions_df, on="playerID", how="left")
batting_df = pd.merge(batting_df, WS_df, on="playerID", how="left")
batting_df = pd.merge(batting_df, decades2_df, on="playerID", how="left")
batting_df = pd.merge(batting_df, lastyear_df, on="playerID", how="left")
batting_df = pd.merge(batting_df, numyear_df, on="playerID", how="left")
batting_df = pd.merge(batting_df, posYrG_df, on=["playerID", "yearID"], how="left")

In [22]:
batting_df.columns

Index(['playerID', 'yearID', 'stint', 'G', 'AB', 'R', 'H', '2B', '3B', 'HR',
       'RBI', 'SB', 'CS', 'BB', 'SO', 'IBB', 'HBP', 'SH', 'SF', 'GIDP', 'Pos',
       'CareerWS', 'decade', 'lastyear', 'numyears', 'Games_P', 'Games_C',
       'Games_1B', 'Games_2B', 'Games_3B', 'Games_SS', 'Games_OF'],
      dtype='object')

Now we start cutting back players we won't be considering.

First, discard pitchers, who would need to be considered under different criteria and whose batting statistics would be irrelevant in any case.

In [23]:
batting2_df = batting_df.loc[batting_df["Pos"] != "P", :]

In [24]:
# discard players from early eras
batting2_df = batting2_df.loc[batting_df["decade"] > 1910, :]

In [25]:
# fewer than ten years would not be enough data to judge a player
batting2_df = batting2_df.loc[batting_df["numyears"] > 9, :]

In [26]:
# discard low-impact players
batting2_df = batting2_df.loc[batting_df["CareerWS"] > 75, :]

In [27]:
batting2_df["wsPerYr"] = batting2_df["CareerWS"] / batting2_df["numyears"]

In [28]:
batting2_df = batting2_df.loc[batting2_df["wsPerYr"] > 10, :]

In [29]:
batting2_df.head(5)

,playerID,yearID,stint,G,AB,R,H,2B,3B,HR,...,lastyear,numyears,Games_P,Games_C,Games_1B,Games_2B,Games_3B,Games_SS,Games_OF,wsPerYr
9,aaronha01,1954,1,122,468,58,131,27,6,13,...,1976,23,0.0,0.0,0.0,0.0,0.0,0.0,116.0,27.956522
10,aaronha01,1955,1,153,602,105,189,37,9,27,...,1976,23,0.0,0.0,0.0,27.0,0.0,0.0,126.0,27.956522
11,aaronha01,1956,1,153,609,106,200,34,14,26,...,1976,23,0.0,0.0,0.0,0.0,0.0,0.0,152.0,27.956522
12,aaronha01,1957,1,151,615,118,198,27,6,44,...,1976,23,0.0,0.0,0.0,0.0,0.0,0.0,150.0,27.956522
13,aaronha01,1958,1,153,601,109,196,34,4,30,...,1976,23,0.0,0.0,0.0,0.0,0.0,0.0,153.0,27.956522

Let's output the group of eligible players we've found so that we can make final selections.
This will be done in Excel so that we can ensure that we have balance over decades and positions.

In [30]:
# drop columns which are no longer needed

del batting2_df ["Games_P"]
del batting2_df ["Games_OF"]
del batting2_df ["Games_1B"]
del batting2_df ["Pos"]
del batting2_df ["CareerWS"]
del batting2_df ["decade"]
del batting2_df ["numyears"]
del batting2_df ["wsPerYr"]
del batting2_df ["stint"]
del batting2_df ["CS"]
del batting2_df ["SO"]
del batting2_df ["IBB"]
del batting2_df ["GIDP"]

In [31]:
batting2_df["PA"] = batting2_df["AB"] + batting2_df["BB"] + batting2_df["HBP"] + batting2_df["SH"] + batting2_df["SF"]

In [32]:
# 495 plate appearances to qualify for computed statistics
batting2_df["AVG"]  = np.where(batting2_df["PA"] > 495,batting2_df["H"]/batting2_df["AB"],0)
batting2_df["SLG"]  = np.where(batting2_df["PA"] > 495,
                              (batting2_df["H"]+batting2_df["2B"]+2*batting2_df["3B"]+3*batting2_df["HR"])/batting2_df["AB"],0)

In [33]:
batting2_df.to_csv("db/batting2.csv", index=False, header=True)